Tekla.Structures.Plugins.StructuresFieldAttribute
The StructuresFieldAttribute class is used for mapping a database attribute to a data field that the plug-in uses in execution.
The attribute is initialized from the custom attribute [StructuresField(attributeName)] in the plug-in source.
In the plug-in the data field must be public and the type must be double, integer or string.

Tekla.Structures.Plugins.StructuresFieldAttribute.#ctor(System.String)
The custom attribute [StructuresField(attributeName)] uses this to map a database attribute to a data field that the plug-in uses in execution.
This is not to be used by itself.
attributeName: The name of the attribute.

Tekla.Structures.Plugins.StructuresFieldAttribute.AttributeName
The name of the attribute.